In [1]:
import pandas as pd
from sqlalchemy import create_engine

### Extract CSVs into DataFrames

In [2]:
import csv
import urllib2

url = 'https://usc.data.socrata.com/Los-Angeles/Income-LA-/kygc-fzgm'
response = urllib2.urlopen(url)
cr = csv.reader(response)

for row in cr:
    print (row)

ModuleNotFoundError: No module named 'urllib2'

In [3]:
county_file = "../Resources/CountyLicenseCount.csv"
county_data_df = pd.read_csv(county_file)
county_data_df.head()

   ID County Name (Licensee)  County ID Code  License Count
0   0                 ALBANY               5             77
1   1               ALLEGANY              59              4
2   2                  BRONX               0            104
3   3                 BROOME              35             14
4   4            CATTARAUGUS              41              9

### Transform premise DataFrame

In [4]:
#
new_premise_data_df = premise_data_df[['License Serial Number', 'Premises Name', 'County ID Code']].copy()
new_premise_data_df.head()
#
new_premise_data_df = new_premise_data_df.rename(columns=
{"License Serial Number":"id", "Premises Name":"premise_name", "County ID Code":"county_id"})
new_premise_data_df
#
new_premise_data_df.drop_duplicates("id", inplace=True)
new_premise_data_df.set_index("id", inplace=True)
new_premise_data_df.head()

                         premise_name  county_id
id
1311660  CANA ARRIBA GROCERY NO 2 INC          0
1310023    JOHANA GROCERY & DELI CORP          0
1310024             TKO BEVERAGES LLC          1
1311663  181 LEXINGTON AVENUE BBQ LLC          2
1310029        AZIZ DELI & GRILL CORP          1

### Transform county DataFrame

In [5]:
#
new_county_data_df = county_data_df[['ID', 'County Name (Licensee)', 'License Count', 'County ID Code']].copy()
new_county_data_df.head()

new_county_data_df = new_county_data_df.rename(columns=
{"ID":"id", "County Name (Licensee)":"county_name", "License Count":"license_count", "County ID Code":"county_id"})
new_county_data_df

new_county_data_df.drop_duplicates("id", inplace=True)
new_county_data_df.set_index("id", inplace=True)
new_county_data_df.head()

    county_name  license_count  county_id
id
0        ALBANY             77          5
1      ALLEGANY              4         59
2         BRONX            104          0
3        BROOME             14         35
4   CATTARAUGUS              9         41

### Create database connection

In [ ]:
connection_string = "root:root@localhost/customer_db"
engine = create_engine(f'mysql+pymysql://{connection_string}')

In [ ]:
# Confirm tables

### Load DataFrames into database